package com.example.osama.azexproj;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class HelenKeller extends AppCompatActivity {
     TextView tv;
    String s;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_helen_keller);
        s="هيلين كيلر (بالإنجليزية: Helen Adams Keller)، ( مواليد 27 يونيو 1880 - 1 يونيو 1968). أديبة ومحاضرة وناشطة أمريكية، وقد عانت هيلين كيلر من المرض في سن اثنى عشر شهراً وافترض أطباء الأطفال بأنها مصابة بحمى القرموزية والتى تصنف بمرض التهاب الرأس مما أدى إلى فقدانها السمع والبصر تماماً. وفي تلك السنوات بدأت كيلر حياتها العلمية مع الأطفال المشابهين لحالتها . وعندما بلغت سن السابعة قرر والديها إيجاد معلم خاص لها . لذلك أرسل مدير مدرسة بيركنزا للمتفوقين الشابة المتخصصة ساليفان . حيث استطاعت ساليفان على الاقتراب من الفتاة والذى كان له دور كبير في مجال التعليم الخاص .\n" +
                "\n" +
                "بعد أن انهت كيلر التعليم الثانوى التحقت كيلر بكلية رادكليف حيث حصلت على شهادة البكالوريوس . وقد عاشت كيلر بعد ذلك مع معلمتها ساليفان بشكل دائم حتى وفاتها . وفي خلال سنوات التعليم أصبحت كيلر إلى مدعمى الاشتراكية وفي عام 1905 انضمت كيلر إلى الحزب الاشتراكى . وقد أصبحت كيلر بعد ذلك ناشطة بارزة وامرأة خيرية .حيث كانت مدعومة من قبل التعليم والتنشئة الاجتماعية للأشخاص من ذوى الإعاقة وكانت شخصية بارزة ونشطة في الاتحاد الأمريكى للحريات المدنية . وفي عام 1934 منحت كيلر جائزة ليندون دجونسون وهو وسام الرئاسة للحرية .ومنذ عام 1980 حيث يحتفل منذ ذلك العام بعيد ميلاد هيلين كيلر بمرسوم صدر من جيمس كارتر حينها . بالإضافة إلى ذلك فقد أصبحت كيلر فتاة ذو ثقافة شعبية حيث كانت شعبيتها من خلال مسرحيتها \" صانع المعجزات \" .";

        tv.setText(s);

    }
}
