package com.example.osama.azexproj;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.ListViewCompat;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import static android.R.layout.simple_list_item_1;

public class quotes extends AppCompatActivity {
ListView l;
String [] q = {      " أصحاب الأنفس العظيمة دائماً ما يواجهون مقاومة عنيفة من أصحاب العقول البسيطة.","المُنافسة الحقيقية دائماً ما تكون بين ما تقوم بعمله وما أنت قادر على عمله، إنك تقيس نفسك مع نفسك وليس مع أي شخص آخر.","النجاح يجذب النجاح، ليس هناك مفر","صاحب الأشخاص الذين يمكن أن يجعلوك أفضل.","النِضال من أجل التميز هو ما يحفزك.","لا شيء يُطلق العظمة الكامنة بداخلنا مثل الرغبة في مساعدة الآخرين وخدمتهم.","مقياس الشخص العظيم حقاُ هو الإحترام الذي يتعامل به مع من هم دونه.","تذكر دوماُ ما أنت بارع فيه وتمسك به.","يمكنك أن تتوقف بعض الوقت ولكن لا تستسلم.","التدريب هو أفضل المعلمين.","إنني لا أحاول الأداء أفضل من أي شخص آخر، إنني فقط أحاول الأداء أفضل من نفسي.","إبتعد عن الأشخاص الذين يحاولون التقليل من شأن طموحاتك، فصِغار الشأن دائماً ما يفعلون ذلك، ولكن العظماء حقاً يجعلونك تشعر أنك أنت أيضاً يمكن أن تصبح عظيماً.","الطريق إلى التميز نادراً ما يكون مزدحماً.",
        "الحياة إمّا أن تكون مُغامرة جرئية أو لا شيء.", " ليس هناك من هو أكثر بؤساً من المرء الذي أصبح اللاقرار هو عادته الوحيدة.",
        "إذا لم تُحاول أن تفعل شيء أبعد مما قد أتقنتهُ، فإنك لا تتقدم أبداً.","إن ما يسعى إليه الإنسان السامي يكمن في ذاته هو، أما الدنيء فيسعى لما لدى الآخرين." , "لن تستطيع أن تمنع طيور الهم أن تُحلق فوق رأسك، ولكنك تستطيع أن تمنعها أن تُعشش في رأسك.","ومن يتهيب صعود الجِبال، يعش أبد الدهر بين الحُفر.","الهُروب هو السبب الوحيد في الفشل، لذا فإنك لن تفشل طالما لم تتوقف عن المحاولة. ",". يجب أن تثق بنفسك، وإذا لم تثق بنفسك فمن ذا الذي سيثق بك!","إن ما تحصل عليه من دون جُهد أو ثمن ليس له قيمه. ","الصلاح مصدر قوة فالرجل المستقيم الصدوق النافع قد لا يصبح مشهوراً أبداً، لكن يصير مُحترماً ومحبُوباً من جميع معارِفِه، لأنه أقام أساساً متيناً من النجاح وسوف يأخذ حقه من الحياة."
        ,"يقال عني معاق ولم تعق عزماتي أرى الحياة أمامي.","ليس من جلس على كرسي معاق لا بل هناك معاق غيرة هو معاق الأخلاق ومعاق العقل ومعاق الضمير والتفكير.","اذني لا تسمع ولكن هنا قلبي يسمع وينظر وبه عزمي","احيانا ليست الحياه كلها جميلة ولكن يمكننا التركيزعلى النواحي الجيدة.","انس كل الأسباب التي ستجعلها تفشل، وركز على إيمانك بالسبب الوحيد الذي سيجعلها تنجح.","إذا أردت أن تتنبأ بالمستقبل، اصنعه.","إذا فزت في ألف معركة فأنت حصلت على ألف عدو. إذا غيرت ألف عقل للأفضل، فأنت حصلت على ألف حليف.","التفكير الإيجابي يرى اللامرئي ويشعر باللامحسوس ويستطيع تحقيق المستحيلات.","اجعل النهاية السعيدة حاضرة في ذهنك، واحرص في كل يوم أن تعمل كي تقترب منها.","إن العصامية هي أن تعيش بضع سنوات من حياتك بشكل يرفضه أغلب الناس، كي تعيش بقية حياتك بشكل لا يستطيعه أكثر الناس.","عندما تتوقف أحلامك، تحين ساعتك.","ليس هناك تحدي أكبر من تحسين وتطوير ذاتك. تصرف كما لو أنه من المستحيل أن تفشل.",
        " إذا كنت تستطيع تخيل صورة ما، يمكنك أن تجعلها واقعاً، وإذا كنت تستطيع أن تحلم يمكِنُك تحقيق حلمك."


};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quotes);
        l = (ListView) findViewById(R.id.listview);
        ArrayAdapter<String> adapter= new ArrayAdapter<String>(this ,android.R.layout.simple_list_item_1,q);
        l.setAdapter(adapter);
    }
}